import React from "react";
import styled from "styled-components";
import Container from "../../Container";
import AllProducts from "./AllProducts";
import MenuItem from "./MenuItem";
import "../verticalLine.css";

const StyledMenu = styled.menu`
  position: relative;
  font-size: 0.8rem;
  display: flex;
  align-items: center;

  & > li {
    padding: 0.9rem 0;
    & > a {
      padding: 0.9rem 0.75rem;
    }

    &:first-child {
      font-weight: 600;

      & > a {
        padding-right: 0;
      }
    }

    &:hover {
      background-color: #f7f7f7;

      & > div {
        display: flex;
      }
    }
  }

  .vertical-line::after {
    height: 30%;
    right: 95%;
    background-color: #eee;
  }
`;

const StyledBg = styled.div`
  background-color: #fff;
  box-shadow: 1px 2px 6px 0px #d3d2d294;
  direction: rtl;
`;

const items = [
  {
    key: 1,
    href: "#drinks",
    name: "المشروبات",
    products: [
      {
        name: "قهوه",
        items: ["خراطيش قهوة", "البن المطحون والعادي", "أكياس قهوة فورية"],
      },
      {
        name: "العصائر",
        items: ["عصائر طويلة الأمد", "شرابات ومحليات"],
      },
      {
        name: "مشروبات الأطفال",
        items: ["عصائر الاطفال"],
      },
      {
        name: "مشروبات بودرة",
        items: ["بودرة عصائر", "الشوكولاته الساخنة"],
      },
      {
        name: "مشروبات غازية",
        items: ["مشروبات الطاقة", "المشروبات الغازية"],
      },
      {
        name: "شاي",
        items: ["شاي مثلج", "أكياس الشاي و الأوراق السائبة", "أكياس الشاي"],
      },
      {
        name: "ماء",
        items: ["المياه المنكهة", "مياه فوارة", "مياه معدنية", "مياه عادية"],
      },
    ],
  },
  {
    key: 2,
    href: "#tablets",
    name: "موبايلات، تابلت وأجهزة اليد الذكية",
    products: [
      {
        name: "الهواتف المحمولة وأجهزة اليد الذكية",
        items: [
          "الهواتف المحمولة",
          "الهواتف الذكية",
          "الساعات الذكية والأجهزة القابلة للارتداء",
        ],
      },
      { name: "التابلت", items: ["تابلت"] },
      {
        name: "اكسسوارات الموبايل",
        items: [
          "شواحن وكابلات ومحولات",
          "سماعات الرأس وسماعات الأذن",
          "حامل موبيل للسيارة",
          "باور بانك",
        ],
      },
    ],
  },
  {
    key: 3,
    href: "#electronics",
    name: "الإلكترونيات والأجهزة المنزلية",
    products: [
      {
        name: "البطاريات",
        items: ["بطاريات", "وصلات وأسلاك التمديد", "محولات ومستلزمات كهربائية"],
      },
      {
        name: "أجهزة منزلية صغيرة",
        items: [
          "تكييف و سخانات و معاج هواء",
          "تحضير الطعام",
          "مكاوي وأجهزة كي بخارية",
          "غلايات وماكينات القهوة",
          "أفران الميكروويف و مواقد محمولة",
          "المحامص والشوايات",
          "المكانس الكهربائية ومكاوي بخارية",
        ],
      },
      {
        name: "أجهزة السينما المنزلية",
        items: [
          "ريسيفر قنوات التلفزيون",
          "أنظمة السينما المنزلية",
          "مكبرات الصوت",
        ],
      },
      {
        name: "هواتف منزلية",
        items: ["الهواتف السلكية"],
      },
      {
        name: "اللاب توب و أجهزة الكمبيوتر",
        items: [
          "اكسسوارات وأجهزة طرفية",
          "كابلات كمبيوتر",
          "مخزن بيانات",
          "حقائب لاب توب",
          "أجهزة الشبكات والاتصال",
          "الطابعات والماسحات الضوئية وأجهزة الفاكس",
          "أحبار",
        ],
      },
      { name: "التلفزيونات", items: ["اكسسوارات التلفزيون", "تلفزيونات"] },
      { name: "ألعاب الفيديو", items: ["ألعاب"] },
      {
        name: "أجهزة منزلية كبيرة",
        items: [
          "أجهزة منزلية بلت ان",
          "بوتاجاز",
          "غسالة أطباق",
          "فريزر",
          "الثلاجات",
          "غسالات ومجففات",
        ],
      },
    ],
  },
  {
    key: 4,
    href: "#supermarket",
    name: "السوبر ماركت",
    products: [
      {
        name: "الأرز والمعكرونة والبقوليات",
        items: ["مكرونة", "البقول والحبوب والكسكس", "أرز"],
      },
      {
        name: "السكر ومستلزمات الخبز",
        items: [
          "خبز الشيكولاتة والكاكاو",
          "لوازم الخبز",
          "السكر والمحليات",
          "دقيق",
        ],
      },
      {
        name: "كيك و بسكويت وكراكرز",
        items: [
          "الكيك وكب كيك و المفن",
          "بسكويت ويفر",
          "كراكرز",
          "بسكويت",
          "بسكويت محشي",
          "مقرمشات",
        ],
      },
      {
        name: "الأغذية المعلبة والمغلفة",
        items: [
          "خضروات معلبة",
          "لبن جوز هند",
          "كريمة جوز الهند",
          "الفواكة المعلبة",
          "المخللات والزيتون",
          "اللحوم المعلبة",
          "لبن بودرة",
          "شوربة ونودلز سريعة التحضير",
          "سمك التونة والمأكولات البحرية",
        ],
      },
      {
        name: "حبوب الإفطار و الشوفان",
        items: ["خبز بف", "حبوب الإفطار", "جرانولا", "الشوفان", "حبوب موسلى"],
      },
      { name: "شيبس ومقبلات", items: ["شيبس و مقرمشات", "شيبس", "الفشار"] },
      {
        name: "الشوكولاتة و حلويات",
        items: ["حلويات", "الشوكولاتة", "علكة و نعناع"],
      },
      {
        name: "الزيوت والخل وصوص السلطة",
        items: ["صوص بنكهات مختلفة", "صوص السلطة و خل"],
      },
      {
        name: "مكونات الطبخ",
        items: [
          "صلصات الطبخ و المكرونة",
          "الأعشاب، التوابل والخلطات",
          "الزيوت والسمن",
          "بقسماط مطحون",
          "مرقات غذائية",
        ],
      },
      {
        name: "المربي و العسل و الأطعمة القابلة للدهن",
        items: ["أطعمة قابلة للدهن", "عسل", "مربات"],
      },
      {
        name: "المكسرات والتمور والفواكه المجففة",
        items: ["مكسرات و بذور", "الفواكه المجففة"],
      },
      {
        name: "منتجات من كل أنحاء العالم",
        items: ["أغذيه مصرية", "مأكولات مكسيكية", "أغذيه صينية"],
      },
    ],
  },
  {
    key: 5,
    href: "#food",
    name: "أطعمة طازجة",
    products: [
      {
        name: "لحوم باردة و مقبلات",
        items: ["لحوم باردة", "زيتون و مقبلات", "المأكولات البحرية والكافيار"],
      },
      {
        name: "منتجات الألبان والبيض",
        items: [
          "الزبدة و السمن",
          "جبنة و لبنة",
          "كريم",
          "بيض",
          "حليب ولبن",
          "الزبادي",
          "الحلويات المبردة",
        ],
      },
      {
        name: "السمك و المأكولات البحرية",
        items: ["سمك", "مأكولات بحرية"],
      },
      {
        name: "مأكولات جاهزة",
        items: ["وجبات جاهزة"],
      },
      {
        name: "دواجن و لحوم",
        items: [
          "لحم بقري",
          "دجاج",
          "لحم ضأن",
          "ديك رومي",
          "أحشاء صالحة للأكل",
          "لحوم ودواجن للشواء",
        ],
      },
    ],
  },
  {
    key: 6,
    href: "#baby",
    name: "مستلزمات الأطفال",
    products: [
      { name: "منتجات العناية بالطفل", items: ["العناية بالأسنان"] },
      {
        name: "مستلزمات الاستحمام و العناية بالبشرة",
        items: [
          "مستلزمات استحمام الأطفال",
          "حقائب ومات لتغيير حفاضات الأطفال",
          "سدادة أذن قطنية",
          "حفاضات ومناديل مبللة للأطفال",
          "مقعد أطفال",
          "ألبسة سباحة متنوعة",
          "الإستحمام والعناية بشرة الأطفال",
        ],
      },
      { name: "مستلزمات الرضاعه الطبيعية", items: ["أكواب شرب للأطفال"] },
      {
        name: "لبن و أغذية الأطفال",
        items: ["أغذية الأطفال", "لبن الأطفال", "وجبات الأطفال"],
      },
    ],
  },
  {
    key: 7,
    href: "#vegetables",
    name: "الخضار",
    products: [
      {
        name: "الفاكهة",
        items: [
          "موز",
          "البرتقال",
          "كليمنتين وماندرين",
          "ليمون حامض",
          "الجريب فروت و بوميلو",
          "التوت",
          "عنب",
          "تفاح",
          "إجاص",
          "المشمش والخوخ",
          "خوخ ونكتارين",
          "كيوي",
          "مانجو",
          "أناناس",
          "شمام",
          "فاكهة غريبة",
          "تمر",
          "فاكهة البذور",
        ],
      },
      {
        name: "خضروات",
        items: [
          "الفليفلة والفلفل الحار",
          "الباذنجان",
          "طماطم",
          "سلطة",
          "الملفوف وغيرها من الطهي",
          "حبوب البازلاء",
          "البطاطس",
          "البصل والشالوت",
          "الخضروات الآسيوية",
          "الفطر",
          "كوسا",
          "جزر",
          "خيار",
          "الثوم والزنجبيل",
        ],
      },
      { name: "أعشاب", items: ["أعشاب طازجة"] },
    ],
  },
];

// const allProducts = items.map(({ products }) => products).flat(1);

const ProductsMenu = () => {
  function renderRemainingItems() {
    return items.map((item) => <MenuItem {...item} />);
  }

  return (
    <StyledBg>
      <Container>
        <StyledMenu>
          <AllProducts />
          {renderRemainingItems()}
        </StyledMenu>
      </Container>
    </StyledBg>
  );
};

export default ProductsMenu;
